## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

OpenTofu will perform the following actions:

  # github_repository.ms1 will be destroyed
  # (because github_repository.ms1 is not in configuration)
  - resource "github_repository" "ms1" {
      - allow_auto_merge            = false -> null
      - allow_merge_commit          = true -> null
      - allow_rebase_merge          = true -> null
      - allow_squash_merge          = true -> null
      - allow_update_branch         = false -> null
      - archived                    = false -> null
      - default_branch              = "master" -> null
      - delete_branch_on_merge      = false -> null
      - description                 = "My awesome web page" -> null
      - etag                        = "W/\"1d520f831e2e71772aedeff55e6117b1d66342e5567a43c11f2be3718fd7ec53\"" -> null
      - full_name                   = "Ellhub/test" -> null
      - git_clone_url               = "git://github.com/Ellhub/test.git" -> null
      - has_discussions             = false -> null
      - has_downloads               = false -> null
      - has_issues                  = false -> null
      - has_projects                = false -> null
      - has_wiki                    = false -> null
      - html_url                    = "https://github.com/Ellhub/test" -> null
      - http_clone_url              = "https://github.com/Ellhub/test.git" -> null
      - id                          = "test" -> null
      - is_template                 = false -> null
      - merge_commit_message        = "PR_TITLE" -> null
      - merge_commit_title          = "MERGE_MESSAGE" -> null
      - name                        = "test" -> null
      - node_id                     = "R_kgDOLRE5ug" -> null
      - primary_language            = "TypeScript" -> null
      - private                     = false -> null
      - repo_id                     = 756103610 -> null
      - squash_merge_commit_message = "COMMIT_MESSAGES" -> null
      - squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> null
      - ssh_clone_url               = "git@github.com:Ellhub/test.git" -> null
      - svn_url                     = "https://github.com/Ellhub/test" -> null
      - topics                      = [
          - "managed-by-terraform",
        ] -> null
      - visibility                  = "public" -> null
      - vulnerability_alerts        = false -> null
      - web_commit_signoff_required = false -> null

      - security_and_analysis {
          - secret_scanning {
              - status = "disabled" -> null
            }
          - secret_scanning_push_protection {
              - status = "disabled" -> null
            }
        }

      - template {
          - include_all_branches = false -> null
          - owner                = "Ellhub" -> null
          - repository           = "nestjs-template-repository" -> null
        }
    }

  # github_repository.ms2 will be created
  + resource "github_repository" "ms2" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = false
      + description                 = "My awesome web page"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "test-repo"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = [
          + "managed-by-terraform",
        ]
      + visibility                  = (known after apply)
      + web_commit_signoff_required = false

      + template {
          + include_all_branches = false
          + owner                = "Ellhub"
          + repository           = "nestjs-template-repository"
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```
</details>